tutorials/lagrangian/reactingParcelFilmFoam/multipleBoxes/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre
runApplication reactingParcelFilmFoam
